<template>
  <div class="page-theme">
    <b-jumbotron>

      <template #header>
        <router-link to="/Language" class="back-redirect-router-link"
                     v-on:click="this.$eventBus.$emit('redirectToJavaRoad')">
          <div class="cl-btn-redirectToLanguage">
          </div>
        </router-link>
        <div class="page-theme-name">
          Распространенные заблуждения относительно Java
        </div>
      </template>

      <div class="page-theme-theory">
        <b-button v-b-toggle.collapse-3 class="m-1 page-theme-collapse-btn">Ознакомиться с теорией</b-button>
        <b-collapse visible id="collapse-3">
          <div class="page-theme-theory-text">
            <p>В завершение этой главы перечислим некоторые распространенные заблуждения,
              связанные с языком Java.
            </p>
            <p>
              <i>
                Язык Java — это расширение языка HTML.
              </i>
            </p>
            <p>Java — это язык программирования, a HTML — способ описания структуры
              веб-страниц. У них нет ничего общего, за исключением дескрипторов HTML-разметки, позволяющих размещать на
              веб-страницах аплеты, написанные на Java.
            </p>
            <p>
              <i>
                Я пользуюсь XML, и поэтому мне не нужен язык Java.
              </i>
            </p>
            <p>
              Java — это язык программирования, a XML — средство описания данных. Данные, представленные в формате XML,
              можно обрабатывать программными средствами, написанными на любом языке программирования, но лишь в
              прикладном
              программном интерфейсе Java API содержатся превосходные средства для обработки
              таких данных. Кроме того, на Java реализованы многие программы независимых производителей,
              предназначенные для работы с XML-документами. Более подробно этот
              вопрос обсуждается во втором томе данной книги.
            </p>
            <p>
              <i>
                Язык Java легко выучить.
              </i>
            </p>
            <p>Нет ни одного языка программирования, сопоставимого по функциональным возможностям с Java, который можно
              было бы легко выучить. Простейшие программы
              написать несложно, но намного труднее выполнить серьезные задания. Обратите также внимание на то, что в
              этой книге обсуждению самого языка Java посвящено лишь
              несколько глав. А в остальных главах рассматривается работа с библиотеками, содержащими тысячи классов и
              интерфейсов, а также многие тысячи методов. Правда, вам
              совсем не обязательно помнить каждый из них, но все же нужно знать достаточно
              много, чтобы применять Java на практике</p>
            <p>
              <i>
                Java со временем станет универсальным языком программирования для всех платформ.
              </i>
            </p>
            <p>Теоретически это возможно, но на практике существуют области, где вполне укоренились другие языки
              программирования. Так, язык Objective С и его последователь
              Swift трудно заменить на платформе iOS для мобильных устройств. Все, что происходит в браузере, обычно
              находится под управлением сценариев на JavaScript. Прикладные программы для Windows написаны на C++ или
              С#. А язык Java лучше всего
              подходит для разработки серверных и межплатформенных клиентских приложений.</p>
            <p>
              <i>
                Java — это всего лишь очередной язык программирования.
              </i>
            </p>
            <p>Java — прекрасный язык программирования. Многие программисты отдают
              предпочтение именно ему, а не языку С, C++ или С#. Но в мире существуют сотни
              великолепных языков программирования, так и не получивших широкого распространения, в то время как языки с
              очевидными недостатками, как, например C++
              и Visual Basic, достигли поразительных успехов.
            </p>
            <p>Почему так происходит? Успех любого языка программирования определяется
              в большей степени его системной поддержкой, чем изяществом его синтаксиса. Существуют ли стандартные
              библиотеки, позволяющие сделать именно то, что требуется
              программисту? Разработана ли удобная среда для создания и отладки программ?
              Интегрирован ли язык и его инструментарий в остальную вычислительную инфраструктуру? Язык Java достиг
              успехов в области серверных приложений, поскольку его
              библиотеки классов позволяют легко сделать то, что раньше было трудно реализовать, например, поддерживать
              работу в сети и организовать многопоточную обработку. Тот факт, что язык Java способствовал сокращению
              количества ошибок, связанных
              с указателями, также свидетельствует в его пользу. Благодаря этому производительность труда программистов
              повысилась. Но не в этом кроется причина его успех</p>
            <p>
              <i>
                Java является патентованным средством, и поэтому пользоваться им не рекомендуется
              </i>
            </p>
            <p>Сразу же после создания Java компания Sun Microsystems предоставляла бесплатные лицензии
              распространителям и конечным пользователям. Несмотря на то что
              компания Sun Microsystems полностью контролировала распространение Java, в работу над этим языком и его
              библиотеками были вовлечены многие другие компании. Исходный код виртуальной машины и библиотек доступен
              всем желающим, но его можно использовать лишь для ознакомления, а вносить в него изменения запрещено. До
              настоящего момента язык Java имел "закрытый исходный кол но прекрасно работал".</p>
            <p>Ситуация изменилась кардинально в 2007 году, когда компания Sun Microsystems
              объявила, что последующие версии Java будут доступны на условиях General Public
              License (GPL) — той же лицензии открытого кода, по которой распространяется ОС
              Linux. Компания Oracle проявила свою приверженность к сохранению открытости
              кода Java, но с одной важной оговоркой — патентованием. Всякий может получить патент на использование и
              видоизменение кода Java по лицензии GPL, но только на настольных и серверных платформах. Так, если вы
              желаете использовать Java во встроенных системах, для этой цели вам потребуется другая лицензия, которая,
              скорее всего,
              повлечет за собой определенные отчисления. Впрочем, срок действия таких патентов
              истекает через десять лет, после чего язык Java станет совершенно бесплатным.</p>
            <p>
              <i>
                Программы на Java работают под управлением интерпретатора, а следовательно,
                серьезные приложения будут выполняться слишком медленно.
              </i>
            </p>
            <p>В начале развития Java программы на этом языке действительно интерпретировались. Теперь в состав всех
              виртуальных машин Java входит динамический компилятор. Критические участки кода будут выполняться не
              медленнее, чем если бы они
              были написаны на C++, а в некоторых случаях даже быстрее.</p>
            <p>Пользователи уже давно жалуются на низкое быстродействие настольных приложений на Java. Но с того
              времени, когда начались эти жалобы, вычислительные мощности компьютеров многократно возросли. И теперь
              медленные программы на Java
              работают быстрее, чем несколько лет назад выполнялись даже самые "молниеносные" программы на C++.
            </p>
            <p>
              <i>
                Все программы на Java выполняются на веб-страницах.
              </i>
            </p>
            <p>Все аплеты, написанные на Java, действительно выполняются в окне веб-браузера.
              Но большинство программ на Java являются независимыми приложениями, которые никак не связаны с
              веб-браузером. Фактически многие программы на Java выполняются на веб-серверах и генерируют код для
              веб-страниц
            </p>
            <p>
              <i>
                Программы на Java представляют большую опасность для системы защиты.
              </i>
            </p>
            <p>В свое время было опубликовано несколько отчетов об ошибках в системе защиты
              Java. Большинство из них касалось реализаций языка Java в конкретных браузерах.
              Исследователи восприняли это как вызов и принялись искать глобальные недостатки в системе защиты Java,
              чтобы доказать недееспособность модели безопасности
              аплетов. Их усилия не увенчались успехом. Обнаруженные ошибки в конкретных
              реализациях вскоре были исправлены. В дальнейшем предпринимались и более серьезные попытки взлома системы
              защиты Java, на которые сначала в компании Sun
              Microsystems, а затем и в компании Oracle реагировали слишком медленно. Намного
              оперативнее (и даже слишком оперативно) отреагировали производители браузеров,
              запретив выполнение прикладного кода на Java по умолчанию. Чтобы оценить значение этого факта, вспомните
              о миллионах вирусных атак из исполняемых файлов
              в Windows и макросы редактора Word, действительно вызвавшие немало хлопот. При
              этом критика недостатков самой платформы для совершения подобных атак была
              удивительно беззубой.</p>
            <p>Некоторые системные администраторы даже стали отключать системы защиты
              языка Java в своих браузерах, чтобы пользователи могли, как и прежде, загружать исполняемые файлы,
              элементы управления ActiveX и документы, созданные с помощью
              текстового процессора Word, что было намного более рискованно. Но даже через двадцать лет после своего
              создания Java по-прежнему остается намного более безопасной
              платформой, чем любая другая исполняющая платформа из всех имеющихся.
            </p>
            <p>
              <i>
                Язык JavaScript — упрощенная версия Java.
              </i>
            </p>
            <p>JavaScript — это язык сценариев, которые можно использовать на веб-страницах.
              Он был разработан компанией Netscape и сначала назывался LiveScript. Синтаксис
              JavaScript напоминает синтаксис Java, но на этом их сходство и заканчивается (за исключением названия,
              конечно). Подмножество JavaScript было нормировано по стандарту ЕСМА-262. Сценарии JavaScript более тесно
              связаны с браузерами, чем аплеты
              Java. В частности, сценарий JavaScript может видоизменить отображаемый документ,
              в то время как аплет контролирует только свою ограниченную область отображения.</p>
            <p>
              <i>
                Пользуясь Java, можно заменить компьютер недорогим устройством для доступа
                к Интернету
              </i>
            </p>
            <p>
              Когда появился язык Java, некоторые были уверены, что так и случится. И хотя
              в продаже появились сетевые компьютеры, оснащенные средствами Java, пользователи не спешат заменить свои
              мощные и удобные персональные компьютеры устройствами без жестких дисков с ограниченными возможностями.
              Ныне основными вычислительными средствами для многих конечных пользователей стали мобильные
              телефоны и планшетные компьютеры. Большая часть этих мобильные устройств работает на платформе Android,
              производной от Java. Поэтому вам будет легче программировать на платформе Android, научившись
              программировать на Java.
            </p>
          </div>
          <div class="page-theme-author-text text-white-50">
            Приведенный материал был взят из книги "Java. Библиотека профессионала, том 1.", написанной Кейем С.
            Хорстманном.
          </div>
        </b-collapse>
      </div>

      <hr class="my-4">

      <div role="group" class="page-theme-form" v-show="showInput">
        <label class="page-theme-question-text">
          Что позволяет современной версии Java не уступать по производительности C++
        </label>

        <div class="answers-input-option">
          <b-form-radio-group
              v-model="selected"
              :options="options"
              class="mb-3"
              value-field="item"
              text-field="name"
              disabled-field="notEnabled"
          ></b-form-radio-group>
        </div>

        <!-- This is a form text block (formerly known as help block) -->
        <b-form-text id="input-live-help">Выберите один из вариантов ответа</b-form-text>
      </div>

      <div v-show="!showInput">
        <label class="page-theme-question-text">
          Что позволяет современной версии Java не уступать по производительности C++
        </label>
        <p class="page-theme-theory-text">
          Ваш ответ: "{{ answer }}"
        </p>
      </div>

      <div class="box animate" style="" v-show="animationOn">Успех</div>

      <b-btn class="my-b-btn page-theme-btn-submit" v-on:click="Request" v-show="showInput">Отправить</b-btn>
    </b-jumbotron>
  </div>
</template>

<script>
import axios from "axios";

let tempAnswer = []
let isSendedandrecived = false

export default {
  name: "Delusions",
  data() {
    return {
      showInput: true,
      answer: [],
      animationOn: false,
      selected: 'Современный синтаксис',
      options: [
        {item: 'Современный синтаксис', name: 'Современный синтаксис'},
        {item: 'Интерпретатор на C++', name: 'Интерпретатор на C++'},
        {item: 'Мультиплатформенная направленность', name: 'Мультиплатформенная направленность'},
        {item: 'Динамический компилятор', name: 'Динамический компилятор'}
      ]
    }
  },
  methods: {
    Request() {
      axios.get('http://localhost:9000/java/firstchapter/', {
        params: {
          numberTheme: 3,
          answer: this.selected,
          userId: window.frontendData.profile.id
        }
      })
          .then(function (response) {
            if (response.data !== 'Incorrect answer') {
              console.log(response.data + ' - data  ')
              window.frontendData.language.chapters[0].listThemes[2].task.answer = response.data
              window.frontendData.language.chapters[0].chapterProgress += 33.3
              window.frontendData.language.chapters[0].listThemes[2].finished = true

              tempAnswer = response.data

              isSendedandrecived = true
            }
          })
          .catch(function (error) {
            console.log(error);
          })
      const interval = setInterval(() => {
        if (isSendedandrecived) {

          this.answer = window.frontendData.language.chapters[0].listThemes[2].task.answer

          this.animationOn = isSendedandrecived
          this.showInput = false

          clearInterval(interval)
        } else {
          this.$toasted.error("Неверный ответ", {
            theme: "toasted-primary",
            position: 'top-right',
            duration: 5000,
            fullWidth: false,
            action: {
              text: 'Cancel',
              onClick: (e, toastObject) => {
                toastObject.goAway(0);
              }
            },
          })
          clearInterval(interval)
        }
      }, 300)
    }
  },
  mounted() {
    if (window.frontendData.language.chapters[0].listThemes[2].finished) {
      this.showInput = false
      this.answer = window.frontendData.language.chapters[0].listThemes[2].task.answer
    }
  },
  beforeDestroy() {
    let container = document.getElementsByClassName('language-main-row-content').item(0)

    let themeToClose = document.getElementById('java-1-chapter-3-theme');

    let topPosOfClosingElement = themeToClose.offsetTop;
    let leftPosOfClosingElement = themeToClose.offsetLeft;

    const pageWidth = document.documentElement.scrollWidth
    const pageHeight = document.documentElement.scrollHeight

    if (pageWidth > leftPosOfClosingElement) {
      container.scrollTo(0, topPosOfClosingElement - pageHeight / 2)
    } else {
      container.scrollTo(leftPosOfClosingElement - pageWidth, topPosOfClosingElement - pageHeight / 2)
    }
  }
}

</script>

<style scoped>

</style>