<template>
  <div class="page-theme">
    <b-jumbotron>

      <template #header>
        <router-link to="/Language" class="back-redirect-router-link"
                     v-on:click="this.$eventBus.$emit('redirectToJavaRoad')">
          <div class="cl-btn-redirectToLanguage">
          </div>
        </router-link>
        <div class="page-theme-name">
          История становления Java
        </div>
      </template>

      <div class="page-theme-theory">
        <b-button v-b-toggle.collapse-3 class="m-1 page-theme-collapse-btn">Ознакомиться с теорией</b-button>
        <b-collapse visible id="collapse-3">
          <div class="page-theme-theory-text">
            <p>История Java восходит к 1991 году, когда группа инженеров из компании Sun
              Microsystems под руководством Патрика Нотона (Patrick Naughton) и члена совета
              директоров (и разностороннего специалиста) Джеймса Гослинга (James Gosling) занялась разработкой языка,
              который можно было бы использовать для программирования бытовых устройств, например, контроллеров для
              переключения каналов кабельного телевидения. Подобные устройства не обладают большими вычислительными
              мощностями и объемом оперативной памяти, и поэтому новый язык должен был
              быть простым и способным генерировать очень компактный код. Кроме того, разные
              производители могут выбирать разные процессоры для контроллеров, и поэтому
              было очень важно не привязываться к конкретной их архитектуре. Проект создания
              нового языка получил кодовое название "Green".</p>
            <p>Стремясь получить компактный и независимый от платформы код, разработчики решили создать переносимый
              язык, способный генерировать промежуточный код для виртуальной машины. Большинство сотрудников компании
              Sun Microsystems имели опыт
              работы с операционной системой Unix, поэтому в основу разрабатываемого ими языка
              был положен язык C++, а не Lisp, Smalltalk или Pascal. Как сказал Гослинг в своем интервью: "Язык — это
              всегда средство, а не цель". Сначала Гослинг решил назвать его Oak
              (Дуб). (Возможно потому, что он любил смотреть на дуб, росший прямо под окнами его
              рабочего кабинета в компании Sun Microsystems.) Затем сотрудники компании узнали,
              что слово "Oak" уже используется в качестве имени ранее созданного языка программирования, и изменили
              название на Java. Этот выбор был сделан по наитию.</p>
            <p>
              В 1992 г. в рамках проекта "Green" была выпущена первая продукция под названием "*7". Это было устройство
              интеллектуального дистанционного управления.
              К сожалению, ни одна из компаний-производителей электронной техники не заинтересовалась этой разработкой.
              Затем группа стала заниматься созданием устройства для кабельного телевидения, которое могло бы
              осуществлять новые виды услуг,
              например, включать видеосистему по требованию. И снова они не получили ни одного контракта.
              Примечательно, что одной из компаний, согласившихся все-таки
              с ними сотрудничать, руководил Джим Кларк (Jim Clark) — основатель компании
              Netscape, впоследствии сделавшей очень много для развития языка Java.
            </p>
            <p>Весь 1993 год и половину 1994 года продолжались безрезультатные поиски покупателей продукции,
              разработанной
              в рамках проекта "Green", получившего новое
              название — "First Person, Inc.". Патрик Нотой, один из основателей группы, в основном занимавшийся
              маркетингом, налетал в общей сложности более 300 тысяч миль,
              пытаясь продать разработанную технологию. Работа над проектом "First Person, Inc."
              была прекращена в 1994 г.</p>
            <p>Тем временем в рамках Интернета начала развиваться система под названием
              World Wide Web (Всемирная паутина). Ключевым элементом этой системы является
              браузер, превращающий гипертекстовые данные в изображение на экране. В 1994 году
              большинство пользователей применяли некоммерческий веб-браузер Mosaic, разработанный в суперкомпьютерном
              центре университета штата Иллинойс в 1993 г. Частично этот браузер был написан Марком Андреессеном (Mark
              Andreessen), подрядившимся работать за 6,85 доллара в час. В то время Марк заканчивал университет,
              и браузер был его дипломной работой. (Затем он достиг известности и успеха как
              один из основателей и ведущих специалистов компании Netscape.)</p>
            <p>В своем интервью журналу Sun World Гослинг сказал, что в середине 1994 г. разработчики нового языка
              поняли:
              "Нам нужно создать высококачественный браузер. Такой браузер должен представлять собой приложение,
              соответствующее технологии "клиент-сервер", в которой жизненно важным является именно то, что мы сделали:
              архитектурная
              независимость, выполнение в реальном времени, надежность, безопасность — вопросы,
              которые были не так уж важны для рабочих станций. И мы создали такой браузер".</p>
            <p>Сам браузер был разработан Патриком Нотоном и Джонатаном Пэйном (Johnatan
              Payne). Позднее он был доработан и получил имя Hotjava. Чтобы продемонстрировать все возможности Java,
              браузер был написан на этом языке. Разработчики браузера Hotjava наделили свой продукт способностью
              выполнять код на веб-страницах. Программный продукт, подтверждавший действенность новой технологии, был
              представлен 23 мая 1995 года на выставке SunWorld '95 и вызвал всеобщий интерес
              к Java, сохраняющийся и по сей день.</p>
            <p>Компания Sun Microsystems выпустила первую версию Java в начале 1996 г. Пользователи быстро поняли, что
              версия Java 1.0 не подходит для разработки серьезных
              приложений. Конечно, эту версию можно применять для реализации визуальных
              эффектов на веб-страницах, например, написать аплет, выводящий на страницу случайно "прыгающий" текст, но
              версия Java 1.0 была еще сырой. В ней даже отсутствовали средства вывода на печать. Грубо говоря, версия
              Java 1.0 еще не была готова.
              В следующей версии, Java 1.1, были устранены наиболее очевидные недостатки, улучшены средства рефлексии и
              реализована новая модель событий для программирования графических пользовательских интерфейсов (ГПИ). Но,
              несмотря на это, ее возможности были все еще ограничены.</p>
            <p>Выпуск версии Java 1.2 стал основной новостью на конференции JavaOne в 1998 г.
              В новой версии слабые средства для создания ГПИ и графических приложений были
              заменены мощным инструментарием. Это был шаг вперед, к реализации лозунга
              "Write Once, Run Anywhere" ("Однажды написано —выполняется везде"), выдвинутого
              при разработке предыдущих версий. В декабре 1998 года через три дня (!) после выхода в свет название новой
              версии было изменено на громоздкое Java 2 Standard Edition
              Software Development Kit Version 1.2 (Стандартная редакция набора инструментальных
              средств для разработки программного обеспечения на Java 2, версия 1.2).</p>
            <p>Кроме Standard Edition, были предложены еще два варианта: Micro Edition ("микроредакция") для портативных
              устройств, например для мобильных телефонов,
              и Enterprise Edition (редакция для корпоративных приложений). В этой книге основное внимание уделяется
              редакции Standard Edition.</p>
            <p>Версии 1.3 и 1.4 редакции Standard Edition стали результатом поэтапного усовершенствования первоначально
              выпущенной версии Java 2. Они обладали новыми возможностями, повышенной производительностью и, разумеется,
              содержали намного
              меньше ошибок. В процессе развития Java многие взгляды на аплеты и клиентские
              приложения были пересмотрены. В частности, оказалось, что на Java удобно разрабатывать высококачественные
              серверные приложения.</p>
            <p>В версии 5.0 язык Java подвергся наиболее существенной модификации с момента
              выпуска версии 1.1. (Первоначально версия 5.0 имела номер 1.5, но на конференции
              JavaOne в 2004 г. была принята новая нумерация версий.) После многолетних исследований были добавлены
              обобщенные типы (которые приблизительно соответствуют
              шаблонам C++), хотя при этом не были выдвинуты требования модификации виртуальной машины. Ряд других
              языковых элементов, например, циклы в стиле for
              each, автоупаковка и аннотации, были явно "навеяны" языком С#.</p>
            <p>Версия 6 (без суффикса .0) была выпущена в конце 2006 г. Опять же сам язык не
              претерпел существенных изменений, но были внесены усовершенствования, связанные с производительностью, а
              также произведены расширения библиотек.</p>
            <p>По мере того как в центрах обработки данных все чаще стали применяться аппаратные средства широкого
              потребления вместо специализированных серверов,
              для компании Sun Microsystems наступили тяжелые времена, и в конечном итоге
              в 2009 году она была приобретена компанией Oracle. Разработка последующих версий Java приостановилась на
              долгое время. И только в 2011 году компания Oracle выпустила новую версию Java 7 с простыми
              усовершенствованиями.</p>
            <p>В 2014 году была выпущена версия Java 8 с наиболее существенными изменениями
              почти за двадцать лет существования этого языка. В версии Java 8 предпринята попытка внедрить стиль
              "функционального" программирования, чтобы упростить выражение вычислений, которые могут выполняться
              параллельно. Все языки программирования должны развиваться, чтобы оставаться актуальным, и в этом
              отношении
              язык Java проявил себя с наилучшей стороны.</p>
            <p>Этапы развития языка Java</p>
            <div>
              <b-table :bordered="true" hover :items="items" class="page-theme-theory-text" caption-top></b-table>
            </div>
          </div>
          <div class="page-theme-author-text text-white-50">
            Приведенный материал был взят из книги "Java. Библиотека профессионала, том 1.", написанной Кейем С.
            Хорстманном.
          </div>
        </b-collapse>
      </div>

      <hr class="my-4">

      <div role="group" class="page-theme-form" v-show="showInput">
        <label class="page-theme-question-text">В какой версии языка был введен стиль "функционального
          программирования"?</label>

        <div class="answers-input-option">
          <b-form-radio-group
              v-model="selected"
              :options="options"
              class="mb-3"
              value-field="item"
              text-field="name"
              disabled-field="notEnabled"
          ></b-form-radio-group>
        </div>

        <!-- This is a form text block (formerly known as help block) -->
        <b-form-text id="input-live-help">Выберите один из вариантов ответа</b-form-text>
      </div>

      <div v-show="!showInput">
        <p class="page-theme-theory-text">
          Ваш ответ: "{{ answer }}"
        </p>
      </div>

      <div class="box animate" style="" v-show="animationOn">Успех</div>

      <b-btn class="my-b-btn page-theme-btn-submit" v-on:click="Request" v-show="showInput">Отправить</b-btn>
    </b-jumbotron>
  </div>
</template>

<script>
import axios from "axios";

let tempAnswer = []
let isSendedandrecived = false

export default {
  name: "History",
  data() {
    return {
      showInput: true,
      answer: [],
      animationOn: false,
      items: [
        {Версия: 1.0, Год_выпуска: 1996, Новые_языковые_средства: 'Выпуск самого языка'},
        {Версия: 1.1, Год_выпуска: 1997, Новые_языковые_средства: 'Внутренние классы'},
        {Версия: 1.2, Год_выпуска: 1998, Новые_языковые_средства: 'Отсутствуют'},
        {Версия: 1.3, Год_выпуска: 2000, Новые_языковые_средства: 'Отсутствуют'},
        {Версия: 1.4, Год_выпуска: 2002, Новые_языковые_средства: 'Утверждения '},
        {
          Версия: 5.0,
          Год_выпуска: 2004,
          Новые_языковые_средства: 'Обобщенные классы, цикл в стиле for each, автоупаковка,\n' +
              'аргументы переменной длины, метаданные, перечисления,\n' +
              'статический импорт'
        },
        {Версия: 6, Год_выпуска: 2006, Новые_языковые_средства: 'Отсутствуют'},
        {
          Версия: 7,
          Год_выпуска: 2009,
          Новые_языковые_средства: 'Оператор switch со строковыми метками ветвей, ромбовидный\n' +
              'оператор, двоичные литералы, усовершенствованная обработка\n' +
              'исключений\n'
        },
        {
          Версия: 8,
          Год_выпуска: 2014,
          Новые_языковые_средства: 'Лямбда-выражения, интерфейсы с методами по умолчанию,\n' +
              'потоки данных и библиотеки даты и времени'
        }
      ],
      selected: '1.3',
      options: [
        {item: '1.3', name: '1.3 version'},
        {item: '7', name: '7 version'},
        {item: '8', name: '8 version'},
        {item: '6', name: '6 version'}
      ]
    }
  },
  methods: {
    Request() {
      axios.get('http://localhost:9000/java/firstchapter/', {
        params: {
          numberTheme: 2,
          answer: this.selected,
          userId: window.frontendData.profile.id
        }
      })
          .then(function (response) {
            if (response.data !== 'Incorrect answer') {
              console.log(response.data + ' - data  ')
              window.frontendData.language.chapters[0].listThemes[1].task.answer = response.data
              window.frontendData.language.chapters[0].chapterProgress += 33.3
              window.frontendData.language.chapters[0].listThemes[1].finished = true

              tempAnswer = response.data

              isSendedandrecived = true
            }
          })
          .catch(function (error) {
            console.log(error);
          })
      const interval = setInterval(() => {
        if (isSendedandrecived) {

          console.log('if')

          this.answer = window.frontendData.language.chapters[0].listThemes[1].task.answer

          this.animationOn = isSendedandrecived
          this.showInput = false

          clearInterval(interval)
        } else {

          console.log('else')

          this.$toasted.error("Неверный ответ", {
            theme: "toasted-primary",
            position: 'top-right',
            duration: 5000,
            fullWidth: false,
            action: {
              text: 'Cancel',
              onClick: (e, toastObject) => {
                toastObject.goAway(0);
              }
            },
          })
          clearInterval(interval)
        }
      }, 300)}
  },
mounted()
{
  if (window.frontendData.language.chapters[0].listThemes[1].finished) {
    this.showInput = false
    this.answer = window.frontendData.language.chapters[0].listThemes[1].task.answer
  }
}
}

</script>

<style scoped>

</style>